Update the use case.
